/*
The MIT License (MIT)

Copyright (c) 2024 sigma-axis

Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the “Software”), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#include <cmath>
#include <algorithm>
#include <optional>

#define NOMINMAX
#define WIN32_LEAN_AND_MEAN
#include <Windows.h>

using byte = uint8_t;
#include <exedit.hpp>

using namespace AviUtl;
using namespace ExEdit;

#include "key_states.hpp"
using namespace sigma_lib::W32::UI;

////////////////////////////////
// 主要情報源の変数アドレス．
////////////////////////////////
inline constinit struct ExEdit092 {
	FilterPlugin* fp;
	decltype(fp->func_WndProc) func_wndproc;
	constexpr static const char* info_exedit092 = "拡張編集(exedit) version 0.92 by ＫＥＮくん";
	bool init(FilterPlugin* this_fp)
	{
		if (fp != nullptr) return true;
		SysInfo si; this_fp->exfunc->get_sys_info(nullptr, &si);
		for (int i = 0; i < si.filter_n; i++) {
			auto that_fp = this_fp->exfunc->get_filterp(i);
			if (that_fp->information != nullptr &&
				0 == std::strcmp(that_fp->information, info_exedit092)) {
				fp = that_fp;
				func_wndproc = fp->func_WndProc;
				init_pointers();
				return true;
			}
		}
		return false;
	}

	int32_t* SortedObjectLayerBeginIndex;	// 0x149670
	int32_t* SortedObjectLayerEndIndex;		// 0x135ac8
	Object** SortedObject;					// 0x168fa8
	Object** ObjectArray_ptr;				// 0x1e0fa4
	int32_t* NextObjectIdxArray;			// 0x1592d8
	int32_t* SettingDialogObjectIndex;		// 0x177a10
	LayerSetting* LayerSettings;			// 0x188498
	int32_t* current_scene;					// 0x1a5310
	int32_t* curr_timeline_scale_len;		// 0x0a3fc8
	int32_t* curr_timeline_layer_height;	// 0x0a3e20
	int32_t* scroll_follows_cursor;			// 0x1790d0
	HWND*	 timeline_h_scroll_bar;			// 0x179108
	int32_t* timeline_h_scroll_pos;			// 0x1a52f0
	int32_t* timeline_width_in_frames;		// 0x1a52f8
	HWND*	 timeline_v_scroll_bar;			// 0x158d34
	int32_t* timeline_v_scroll_pos;			// 0x1a5308
	int32_t* timeline_height_in_layers;		// 0x0a3fbc

	int32_t* timeline_drag_kind;			// 0x177a24
		// 0: ドラッグなし．
		// 1: オブジェクト移動ドラッグ．
		// 2: オブジェクトの左端をつまんで移動．
		// 3: 中間点や右端をつまんで移動．
		// 4: 現在フレームを動かすドラッグ．
		// 5: ? 不明．
		// 6: Ctrl での複数選択ドラッグ．
		// 7: Alt でのスクロールドラッグ．
	int32_t* timeline_drag_edit_flag;		// 0x177a08, 0: clean, 1: dirty.
		// makes sense only for drag kinds 1, 2, 3 above.

	int32_t* timeline_BPM_tempo;			// 0x159190, multiplied by 10'000
	int32_t* timeline_BPM_frame_origin;		// 0x158d28, 1-based
	int32_t* timeline_BPM_num_beats;		// 0x178e30
	int32_t* timeline_BPM_show_grid;		// 0x196760, 0: hidden, 1: visible

private:
	void init_pointers()
	{
		auto pick_addr = [this,exedit_base = reinterpret_cast<uintptr_t>(fp->dll_hinst)]
			<class T>(T& target, ptrdiff_t offset) { target = reinterpret_cast<T>(exedit_base + offset); };
		pick_addr(SortedObjectLayerBeginIndex,	0x149670);
		pick_addr(SortedObjectLayerEndIndex,	0x135ac8);
		pick_addr(SortedObject,					0x168fa8);
		pick_addr(ObjectArray_ptr,				0x1e0fa4);
		pick_addr(NextObjectIdxArray,			0x1592d8);
		pick_addr(SettingDialogObjectIndex,		0x177a10);
		pick_addr(LayerSettings,				0x188498);
		pick_addr(current_scene,				0x1a5310);
		pick_addr(curr_timeline_scale_len,		0x0a3fc8);
		pick_addr(curr_timeline_layer_height,	0x0a3e20);
		pick_addr(scroll_follows_cursor,		0x1790d0);
		pick_addr(timeline_h_scroll_bar,		0x179108);
		pick_addr(timeline_h_scroll_pos,		0x1a52f0);
		pick_addr(timeline_width_in_frames,		0x1a52f8);
		pick_addr(timeline_v_scroll_bar,		0x158d34);
